"use client";

import React, { useState } from "react";
import HeaderLogo from "../components/HeaderLogo";
import Icon from "@mdi/react";
import { mdiAccountEdit, mdiCloseCircle } from "@mdi/js";
import Footer from "../components/Footer";
import { useRouter } from "next/navigation";
import Register from "../register/page";
import { useSession, signOut } from "next-auth/react";
import { useTheme } from "../ThemeContext";
import Link from "next/link";

function Agreement() {
  const {
    fontSize,
    bgColorNavbar,
    bgColor,
    bgColorWhite,
    bgColorMain,
    bgColorMain2,
    inputGrayColor,
    inputTextColor,
  } = useTheme();

  const [statusAgreement, setStatusAgreement] = useState(false);
  const [isChecked, setIsChecked] = useState(false);
  const [error, setError] = useState("");
  const router = useRouter();
  const { data: session } = useSession();

  function handleAgreement() {
    if (isChecked) {
      router.replace("/register");
      setStatusAgreement(true);
    } else {
      setError("คุณไม่ได้ยอมรับเงื่อนไขการใช้งานบริการ");
    }
  }

  function handleLogout() {
    signOut({ callbackUrl: "/" });
  }

  return (
    <div className={`min-h-screen ${bgColorMain} ${bgColor} ${fontSize}`}>
      {statusAgreement ? (
        <Register statusAgreement={statusAgreement} />
      ) : (
        <div className="flex flex-col min-h-screen">
          <HeaderLogo />
          
          <main className="flex-grow w-full flex justify-center items-start py-4 sm:py-8">
            <div className="w-full px-4 sm:px-6 max-w-screen-xl">
              <div className={`${bgColorMain2} p-5 sm:p-10 rounded-lg shadow-sm`}>
                <p className="text-lg md:text-xl font-extrabold text-center mb-6">
                  เงื่อนไขข้อตกลงการใช้บริการสำหรับผู้หางาน และ/หรือ ผู้สมัคร
                </p>
                
                <div className="mt-4 md:mt-8 text-sm md:text-base leading-relaxed">
                  <p style={{ textIndent: "2.5rem" }} className="mb-4">
                    เงื่อนไขข้อตกลงการใช้บริการสำหรับนักศึกษา และ/หรือ ผู้หางาน
                    และ/หรือ ผู้สมัคร
                    <br />
                    เงื่อนไขและข้อตกลงที่ระบุไว้ดังต่อไปนี้ (ต่อไปนี้จะเรียกว่า
                    “เงื่อนไขข้อตกลงการใช้บริการ”) เป็นสัญญาระหว่าง
                    มูลนิธินวัตกรรมทางสังคม (ต่อไปนี้เรียกว่า “มูลนิธิ”)
                    ในฐานะผู้ให้บริการค้นหางาน หรือจับคู่งาน ให้คนพิการ และ/หรือ
                    สมัครงานสำหรับผู้หางานคนพิการ และค้นประวัติ และ/หรือ
                    ประกาศรับสมัครงานสำหรับผู้ประกอบการ โดยผ่านทางเว็บไซต์
                    และ/หรือ แอปพลิเคชันต่าง ๆ ของ มูลนิธิ กับผู้หางาน และ/หรือ
                    ผู้สมัคร ในฐานะผู้ใช้บริการ
                    โปรดอ่านข้อตกลงนี้อย่างละเอียดและครบถ้วน
                  </p>
                  
                  <div className="space-y-4">
                    <p><strong>คำจำกัดความ</strong></p>
                    <p>ภายใต้เงื่อนไขข้อตกลงการใช้บริการฉบับนี้ นอกจากจะกำหนดไว้เป็นอย่างอื่น “คำ” และ “ข้อความ” ใด ๆ ดังต่อไปนี้ ให้มีความหมายตามที่กำหนดไว้ด้านล่าง</p>
                    
                    <p>“Candidatepools” หมายถึง บริการค้นหางาน และ/หรือ สมัครงานสำหรับผู้หางาน และค้นประวัติ และ/หรือ ประกาศรับสมัครงานสำหรับผู้ประกอบการ โดยผ่านทางเว็บไซต์ และ/หรือ แอปพลิเคชัน รวมถึงผลิตภัณฑ์ต่าง ๆ ที่อาจมีขึ้นในอนาคตของ มูลนิธินวัตกรรมทางสังคม</p>
                    
                    <p>“การโฆษณา” หมายถึง การประกาศรับสมัครงานโดยมีวัตถุประสงค์เพื่อหาบุคคลเข้าทำงานในตำแหน่งใด ๆ รวมถึงการโฆษณาในรูปแบบใด ๆ ที่ปรากฏอยู่บน แพลตฟอร์ม</p>
                    
                    <p>“ข้อมูล” หมายถึง ข้อความ ไฟล์เสียง เพลง รูปภาพ วิดีโอ และสิ่งอื่น ๆ ที่คล้ายคลึงกัน</p>
                    
                    <p>“ผู้หางาน” หมายถึง ผู้ใช้บริการ แพลตฟอร์มเพื่อวัตถุประสงค์ในการหางาน ซึ่งรวมถึงผู้ใช้บริการที่ได้สมัครเป็นสมาชิกกับ บริการของมูลนิธินวัตกรรมทางสังคมและผู้ใช้บริการที่ไม่ได้สมัครเป็นสมาชิกกับ แพลตฟอร์มของมูลนิธินวัตกรรมทางสังคม</p>
                    
                    <p>“ผู้สมัคร” หมายถึง ผู้ที่ยื่นสมัครงานตามตำแหน่งที่ปรากฏหรือโฆษณาบน แพลตฟอร์ม</p>
                    
                    <p>“ผู้ประกอบการ” หมายถึง บุคคลธรรมดา หรือนิติบุคคลที่จดทะเบียนถูกต้องตามกฎหมาย โดยรวมถึง ห้างหุ้นส่วนจำกัด บริษัทจำกัด บริษัทมหาชนจำกัด และ/หรือ นิติบุคคลตามกฎหมายชนิดอื่น ๆ ที่สมัครสมาชิกกับ แพลตฟอร์มของมูลนิธินวัตกรรมทางสังคม</p>
                    
                    <p>“ชื่อผู้ใช้” หมายถึง อีเมลที่ผู้หางานคนพิการ หรือนักศึกษาพิการ กำหนดขึ้น และได้รับอนุมัติเพื่อใช้เข้าสู่การให้บริการของ แพลตฟอร์มของมูลนิธินวัตกรรมทางสังคม</p>
                    
                    <p>“รหัสผ่าน” หมายถึง รหัสที่ผู้หางานคนพิาร หรือนักศึกษาพิการ กำหนดขึ้น และได้รับอนุมัติเพื่อใช้เข้าสู่การให้บริการของ แพลตฟอร์มของมูลนิธินวัตกรรมทางสังคม</p>
                    
                    <p>“บริการ” หมายถึง บริการที่นำเสนอบน แพลตฟอร์มของมูลนิธินวัตกรรมทางสังคมรวมถึงการนำเสนอข้อมูลข่าวสารที่เป็นประโยชน์ต่อ ผู้ประกอบการ ผู้หางานคนพิการ หรือนักศึกษาพิการ และ/หรือ บุคคลทั่วไป โดยมีทั้งแบบมีค่าใช้จ่ายและไม่มีค่าใช้จ่าย</p>
                    
                    <p>“ประวัติ ” หมายถึง ประวัติส่วนบุคคลของผู้หางานคนพิการ หรือนักศึกษาพิการ รวมถึงประวัติการศึกษา ประสบการณ์การทำงานที่ถูกจัดทำโดยผู้หางานคนพิการ หรือนักศึกษาพิการ ซึ่งถูกจัดเก็บไว้ในระบบ แพลตฟอร์มของมูลนิธินวัตกรรมทางสังคมโดยความยินยอมของเจ้าของข้อมูล</p>
                    
                    <p>“ใบสมัคร” หมายถึง ใบสมัครที่ผู้หางานคนพิการ หรือนักศึกษาพิการ และ/หรือ ผู้สมัครทำขึ้นตามตำแหน่งงานที่ปรากฏหรือโฆษณาบน แพลตฟอร์มของมูลนิธินวัตกรรมทางสังคม</p>

                    <p><strong>1. การตกลงยอมรับเงื่อนไขและข้อกำหนด</strong></p>
                    <p>1.1. เงื่อนไขข้อตกลงการใช้บริการที่ระบุไว้นี้จะมีผลผูกพันต่อผู้หางาน และ/หรือ ผู้สมัครซึ่งใช้บริการของ มูลนิธิทันทีที่ผู้หางาน และ/หรือ ผู้สมัครกดยอมรับเงื่อนไขข้อตกลงการใช้บริการฉบับนี้</p>
                    <p>1.2. ผู้หางาน และ/หรือ ผู้สมัครได้อ่านทำความเข้าใจเงื่อนไขและข้อตกลงด้วยดีโดยตลอดแล้ว และตกลงยอมรับเงื่อนไขข้อตกลงการใช้บริการฉบับนี้ก่อนเริ่มต้นใช้บริการ</p>
                    <p>1.3. ผู้หางาน และ/หรือ ผู้สมัครทุกรายจะต้องใช้บริการตามข้อกำหนดที่ระบุไว้ในเงื่อนไขข้อตกลงการใช้บริการฉบับนี้ ทั้งนี้หากมีข้อกำหนดเพิ่มเติมสำหรับบริการ ผู้หางาน และ/หรือ ผู้สมัครจะต้องปฏิบัติตามข้อกำหนดที่ระบุไว้ในเงื่อนไขข้อตกลงการใช้บริการเพิ่มเติมนั้นด้วย</p>

                    <p><strong>2. ชื่อผู้ใช้และรหัสผ่าน</strong></p>
                    <p>2.1. ผู้หางานตกลงจะรักษาไว้ซึ่งความลับและไม่เปิดเผยชื่อผู้ใช้ และรหัสผ่านหรือรหัสอื่นใด (ถ้ามี) สำหรับการใช้บริการ ระบบ Candidatepools ต่อบุคคลอื่นไม่ว่าด้วยเหตุผลใด ๆ มูลนิธิจะไม่รับผิดชอบต่อความเสียหายใด ๆ ที่เกิดขึ้นอันเนื่องมาจากการสูญหายของชื่อผู้ใช้ และรหัสผ่านหรือรหัสอื่นใด (ถ้ามี) หรือหากมีบุคคลอื่นล่วงรู้ชื่อผู้ใช้และรหัสผ่านดังกล่าว</p>
                    <p>2.2. ผู้หางานยอมรับว่าธุรกรรมใด ๆ หรือการใช้บริการใด ๆ ที่ทำโดยใช้ชื่อผู้ใช้ และรหัสผ่านหรือรหัสอื่นใด (ถ้ามี) ของผู้หางานให้ถือว่าเป็นการกระทำของผู้หางานเอง และมีผลผูกพันต่อผู้หางาน โดยผู้หางานไม่จำเป็นต้องลงนามในเอกสารใด ๆ</p>
                    <p>2.3. เพื่อความปลอดภัย หากผู้หางานทราบว่ามีบุคคลภายนอกรับรู้ชื่อผู้ใช้ และ รหัสผ่านหรือรหัสอื่นใด (ถ้ามี) ของผู้หางาน มูลนิธิแนะนำให้ผู้หางานเปลี่ยนแปลงชื่อผู้ใช้ รหัสผ่านหรือรหัสอื่นใด (ถ้ามี) ของผู้หางาน</p>

                    <p><strong>3. ขอบเขตการให้บริการ</strong></p>
                    <p>3.1. เพื่อความปลอดภัยหรือเหตุจำเป็นอื่นใด มูลนิธิอาจแก้ไขเปลี่ยนแปลงหรือเพิ่มเติมเงื่อนไขข้อตกลงการใช้บริการนี้ โดยมิต้องให้คำบอกกล่าวหรือแจ้งเตือนผู้หางาน และ/หรือ ผู้สมัครเป็นการล่วงหน้า มูลนิธิแนะนำให้ผู้หางาน และ/หรือ ผู้สมัครตรวจสอบเงื่อนไขข้อตกลงการใช้บริการเป็นประจำระหว่างการใช้บริการ อย่างไรก็ตาม หากบริษัทเปลี่ยนแปลงเงื่อนไขข้อตกลงการใช้บริการนี้อย่างมีนัยสำคัญ บริษัทจะแจ้งผู้หางาน และ/หรือ ผู้สมัครโดยการส่งอีเมล หรือแจ้งผู้หางาน และ/หรือ ผู้สมัครโดยวิธีประกาศในเว็บไซต์ และ/หรือ แอปพลิเคชันของ มูลนิธิ</p>
                    <p>3.2. ทรัพย์สินทางปัญญาทั้งหมดที่เกี่ยวข้องกับ มูลนิธิบัญชีผู้ใช้งาน ข้อมูล เนื้อหา และบริการต่าง ๆ ที่ถูกสร้างสรรค์และพัฒนาบนเว็บไซต์ และ/หรือ แอปพลิเคชันต่าง ๆ ของ มูลนิธิหรือได้รับมาในระหว่างการให้บริการถือเป็นสิทธิของมูลนิธิแต่เพียงผู้เดียว โดยห้ามมิให้ ทำซ้ำ คัดลอก ถ่ายสำเนา ดัดแปลง เผยแพร่ หรือกระทำการอื่นใด เพื่อเผยแพร่ต่อสาธารณชน หรือเพื่อหาประโยชน์ โดยไม่ได้รับการยินยอมเป็นลายลักษณ์อักษรล่วงหน้าจากมูลนิธิ</p>
                    <p>3.3. มูลนิธิจะไม่รับผิดชอบต่อความเสียหาย ค่าใช้จ่าย หรือความสูญเสียที่อาจเกิดขึ้นจากการให้บริการ ซึ่งรวมถึง ความล่าช้าในการถ่ายโอนข้อมูล ระยะเวลาในการเผยแพร่ข้อมูล เหตุขัดข้องหรือเหตุอื่นใดที่เป็นอุปสรรคต่อการเข้าใช้บริการ แพลตฟอร์มของมูลนิธิการเชื่อมต่อ ความผิดพลาดในการแสดงผล ความเสถียรของระบบ ไวรัสคอมพิวเตอร์ หากได้ดูแลตามสมควรหรือตามพฤติการณ์แล้ว</p>
                    <p>3.4. ผู้หางานตกลงและยินยอมมอบข้อมูลในรูปแบบและประเภทต่าง ๆ ตามแต่ที่มูลนิธิร้องขอเท่าที่จำเป็นเพื่อประโยชน์ในการให้บริการ</p>
                    <p>3.5. มูลนิธิจะไม่รับผิดชอบต่อความล้มเหลวหรือข้อบกพร่องในการให้บริการไม่ว่าส่วนใดส่วนหนึ่งหรือทั้งหมด อันเป็นผลมาจากการไม่ปฏิบัติตามเงื่อนไขข้อตกลงการใช้บริการฉบับนี้</p>
                    <p>3.6. ผู้หางานตกลงและยอมรับว่าบัญชีผู้ใช้งานมีไว้เพื่อการใช้งานเฉพาะและเป็นของเจ้าของบัญชีผู้ใช้งานแต่เพียงผู้เดียวเท่านั้น ผู้หางานไม่สามารถโอนหรือให้ยืมบัญชีผู้ใช้งานของตนแก่บุคคลภายนอกใด ๆ และบุคคลภายนอกใด ๆ ไม่สามารถรับช่วงบัญชีผู้ใช้งานจากผู้หางานได้ อีกทั้งธุรกรรมใด ๆ หรือการใช้บริการใด ๆ ที่ทำโดยบัญชีผู้ใช้งานนั้นให้ถือว่าเป็นการกระทำของผู้หางานเองและมีผลผูกพันต่อผู้หางานเท่านั้น</p>
                    <p>3.7. มูลนิธิสงวนสิทธิ์ที่จะแสดงโฆษณาสำหรับผู้ประกอบการหรือบุคคลภายนอก รวมถึงเพื่อ แพลตฟอร์มของมูลนิธิเอง ให้ผู้หางานผ่านทางเว็บไซต์และแอปพลิเคชันต่าง ๆ ของ มูลนิธิ</p>
                    <p>3.8. มูลนิธิจะไม่ผูกพันต่อการให้บริการจนกว่าผู้หางานจะส่งมอบข้อมูลที่จำเป็นต่อการให้บริการแก่บริษัมูลนิธิ</p>

                    <p><strong>4. ประวัติผู้สมัคร ใบสมัคร และเอกสารประกอบการสมัครงานอื่น ๆ</strong></p>
                    <p>หากผู้หางาน และ/หรือ ผู้สมัครทำการบันทึกรายละเอียดและเก็บประวัติ Candidatepools หรือใบสมัคร หรือเอกสารประกอบการสมัครงานอื่น ๆ ไว้กับ มูลนิธิ</p>
                    <p>4.1. การบริการเก็บรักษาประวัติ หรือใบสมัคร หรือเอกสารประกอบการสมัครงานอื่น ๆ และส่งให้แก่ผู้ประกอบการใด ๆ ต้องได้รับความยินยอมจากผู้หางาน และ/หรือ ผู้สมัครเพื่อส่งต่อให้กับผู้ประกอบการ บริษัทมีหน้าที่เพียงแต่ส่งมอบประวัติ หรือใบสมัคร หรือเอกสารประกอบการสมัครงานอื่น ๆ ให้แก่ผู้ประกอบการ เพื่อวัตถุประสงค์ในการรับสมัครงานเท่านั้น</p>
                    <p>4.2. ผู้ประกอบการสามารถค้นหาประวัติ ได้ ซึ่งมูลนิธิไม่สามารถรับประกันถึงจำนวนประวัติ ขั้นต่ำที่จะถูกค้นหาหรือถูกติดต่อโดยผู้ประกอบการ หรือส่งมอบให้แก่ผู้ประกอบการในแต่ละวัน</p>
                    <p>4.3. ผู้ประกอบการอาจส่งต่อประวัติ หรือใบสมัคร หรือเอกสารประกอบการสมัครงานอื่น ๆ ของผู้หางาน และ/หรือ ผู้สมัครให้กับผู้ที่เกี่ยวข้อง</p>
                    <p>4.4. มูลนิธิอาจแจ้งให้ผู้หางานทราบถึงความไม่ถูกต้องหรือไม่เหมาะสมของประวัติ ที่ผู้หางานฝากไว้กับ มูลนิธิ</p>
                    <p>4.5. มูลนิธิมีสิทธิเด็ดขาดที่จะปฏิเสธไม่แจกจ่าย เผยแพร่ ส่งต่อ หรือ ยกเลิก รวมทั้งนำออกจากระบบ ของประวัติ หรือใบสมัคร หรือเอกสารประกอบการสมัครงานอื่น ๆ ที่ผู้หางาน และ/หรือ ผู้สมัครได้ส่งให้แก่บริษัท หรือถูกบันทึกและจัดเก็บในระบบ</p>
                    <p>4.6. มูลนิธิอาจปฏิเสธ ถอดถอน หรือแก้ไขข้อมูล ประวัติ หรือใบสมัคร หรือเอกสารประกอบการสมัครงานอื่น ๆ ของผู้หางาน และ/หรือ ผู้สมัครที่ขัดต่อกฎหมาย ศีลธรรมอันดี หรือมีเนื้อหาอนาจาร น่ารังเกียจ หรือด้วยเหตุอื่นใดอันมิชอบด้วยกฎหมาย ตลอดจนข้อมูลไม่ถูกต้อง ผิดพลาด ไม่ครบถ้วน ไม่สมบูรณ์ ถูกลบ ถูกแก้ไข หรือมีข้อบกพร่อง มูลนิธิสามารถแก้ไขข้อมูลเพื่อให้ถูกต้องสมบูรณ์ตามที่เห็นสมควรได้โดยมิต้องบอกกล่าว</p>
                    <p>4.7. ผู้หางาน และ/หรือ ผู้สมัครขอรับรองและยืนยันว่า</p>
                    <p>4.7.1. ประวัติ หรือใบสมัคร หรือเอกสารประกอบการสมัครงานอื่น ๆ ตลอดจนรายละเอียดและข้อมูลอื่นใดที่ถูกบันทึกและจัดเก็บไว้ในระบบ ของมูลนิธิเป็นข้อมูลที่ถูกต้อง ครบถ้วน ตามจริง และเป็นปัจจุบัน หากมีการเปลี่ยนแปลงใด ๆ ของรายละเอียดและข้อมูลดังกล่าว ผู้หางาน และ/หรือ ผู้สมัครมีหน้าที่ต้องแก้ไขปรับปรุงให้ถูกต้อง ครบถ้วน ตามจริง และเป็นปัจจุบันเสมอ</p>
                    <p>4.7.2. ตลอดระยะเวลาการใช้งานเว็บไซต์ และ/หรือ แอปพลิเคชันของ มูลนิธินั้น ผู้หางาน และ/หรือ ผู้สมัครตกลงว่าจะไม่กระทำการใด ๆ อันเป็นการขัดต่อข้อกฎหมาย ศีลธรรม รวมทั้งจะไม่กระทำการใด ๆ ซึ่งถือเป็นการละเมิดสิทธิใด ๆ ของมูลนิธิหรือบุคคลอื่น หรืออาจจะก่อให้เกิดความเสียหายต่อมูลนิธิหรือบุคคลอื่น</p>
                    <p>4.7.3. หากพบว่าผู้หางาน และ/หรือ ผู้สมัครได้ฝ่าฝืนกฎหมายหรือเงื่อนไขข้อตกลงการใช้บริการที่เกี่ยวกับข้อมูลจากผู้หางาน และ/หรือ ผู้สมัคร หรือข้อมูลที่ถูกบันทึกและจัดเก็บไว้ในระบบ มีความผิดพลาดหรือไม่ ไม่ว่าทางใดทางหนึ่ง มูลนิธิขอสงวนสิทธิ์ในการย้ายหรือถอดถอนข้อมูลทั้งหมดหรือบางส่วน ลบบัญชีผู้ใช้งาน และ/หรือ ระงับการใช้บริการตามดุลพินิจของมูลนิธิโดยมิต้องบอกกล่าว</p>
                    <p>4.7.4. ประวัติ หรือใบสมัคร หรือเอกสารประกอบการสมัครงานอื่น ๆ ที่ผู้หางาน และ/หรือ ผู้สมัครได้ส่งให้แก่มูลนิธิหรือถูกบันทึกและจัดเก็บในระบบ ของมูลนิธิหากมี ชื่อ ภาพ ข้อมูลติดต่อ หรือข้อมูลส่วนบุคคลของบุคคลอื่น ไม่ว่าส่วนใดส่วนหนึ่งหรือทั้งหมด หรือสำเนาเอกสารใดที่พิสูจน์ถึงความมีอยู่ของบุคคลอื่น ผู้หางาน และ/หรือ ผู้สมัครขอรับรองและยืนยันว่าได้รับความยินยอมจากเจ้าของข้อมูลส่วนบุคคลนั้นแล้ว และมีสิทธิที่จะนำข้อมูลหรือเอกสารของบุคคลนั้นมาใช้ประกอบการสมัครงานหรือที่เกี่ยวข้องกับการสมัครงาน ในการนี้ มูลนิธิจะไม่รับผิดชอบต่อความเสียหายใด ๆ ที่เกิดขึ้น ตลอดจนหากมีการฟ้องร้องหรือเรียกร้องใด ๆ ในการนำข้อมูลหรือเอกสารดังกล่าวข้างต้นมาใช้</p>
                    <p>4.8. มูลนิธิจะเก็บประวัติ หรือใบสมัคร หรือเอกสารประกอบการสมัครงานอื่น ๆ ไว้จนกว่าผู้หางาน และ/หรือ ผู้สมัครมีความประสงค์จะลบข้อมูลออกจากระบบ</p>

                    <p><strong>5. การสมัครงาน</strong></p>
                    <p>5.1. วิธีการสมัครงานผ่าน ระบบ Candidatepools มีด้วยกัน 2 วิธี คือ</p>
                    <p>5.1.1. สมัครโดยการฝากประวัติกับ ระบบ Candidatepools ผู้หางานสามารถสมัครงานโดยผ่านช่องทางการสมัครเป็นสมาชิกของ มูลนิธิและสร้างประวัติฝากไว้กับ ระบบ Candidatepools</p>
                    <p>5.1.2. สมัครโดยการ สร้างเรซูเม่ ผลงาน หรือเอกสารประกอบการสมัครงาน...</p>
                  </div>
                </div>

                {/* Checkbox Section - Adjusted for touch devices */}
                <div
                  onClick={() => setIsChecked(!isChecked)}
                  className={`${fontSize} cursor-pointer flex items-start sm:items-center gap-3 justify-center mt-8 md:mt-10 px-2`}
                >
                  <input
                    checked={isChecked}
                    onChange={() => setIsChecked(!isChecked)}
                    className="cursor-pointer w-5 h-5 mt-1 sm:mt-0"
                    id="checkStatus"
                    type="checkbox"
                  />
                  <p className="select-none">ยอมรับเงื่อนไขการใช้บริการและอนุญาตการใช้ข้อมูล</p>
                </div>

                {error && (
                  <p className="text-center text-red-500 mt-3 text-sm font-medium">* {error}</p>
                )}

                {/* Action Buttons - Stacked on mobile, side-by-side on tablet+ */}
                <div className="flex flex-col sm:flex-row justify-center mt-8 gap-4 sm:gap-10">
                  {session ? (
                    <div
                      onClick={handleLogout}
                      className={`${bgColorNavbar} ${bgColorWhite} hover:cursor-pointer bg-[#F97201] py-2.5 px-6 rounded-2xl flex justify-center items-center gap-2 border border-white transition-all`}
                    >
                      <Icon path={mdiCloseCircle} size={0.9} />
                      <p>ยกเลิก</p>
                    </div>
                  ) : (
                    <Link
                      href="/"
                      className={`${bgColorNavbar} ${bgColorWhite} hover:cursor-pointer bg-[#F97201] py-2.5 px-6 rounded-2xl flex justify-center items-center gap-2 border border-white transition-all`}
                    >
                      <Icon path={mdiCloseCircle} size={0.9} />
                      <p>ยกเลิก</p>
                    </Link>
                  )}
                  
                  <button
                    onClick={handleAgreement}
                    type="submit"
                    className={`${inputTextColor} ${inputGrayColor} hover:cursor-pointer py-2.5 px-6 rounded-2xl flex justify-center items-center gap-2 border border-white transition-all shadow-md`}
                  >
                    <Icon path={mdiAccountEdit} size={0.9} />
                    <p>ลงทะเบียน</p>
                  </button>
                </div>
              </div>
            </div>
          </main>
          
          <Footer />
        </div>
      )}
    </div>
  );
}

export default Agreement;